In [4]:
import pandas as pd
import numpy as np

# Exercise 1

In [5]:
chipo = pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv', sep='\t')

In [6]:
chipo.head(10)

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98
5,3,1,Chicken Bowl,"[Fresh Tomato Salsa (Mild), [Rice, Cheese, Sou...",$10.98
6,3,1,Side of Chips,NaN,$1.69
7,4,1,Steak Burrito,"[Tomatillo Red Chili Salsa, [Fajita Vegetables...",$11.75
8,4,1,Steak Soft Tacos,"[Tomatillo Green Chili Salsa, [Pinto Beans, Ch...",$9.25
9,5,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Pinto...",$9.25

In [7]:
print('Rows: ',chipo.shape[0])

Rows:  4622

In [8]:
print('Columns: ',chipo.shape[1])

Columns:  5

In [9]:
print('Index type:', chipo.index)

Index type: RangeIndex(start=0, stop=4622, step=1)

In [10]:
print('Most ordered item:', chipo['item_name'].value_counts().idxmax())

Most ordered item: Chicken Bowl

In [11]:
print('Total items ordered:', chipo['quantity'].sum())

Total items ordered: 4972

In [12]:
print('Most ordered item:', chipo['choice_description'].value_counts().idxmax())

Most ordered item: [Diet Coke]

In [13]:
chipo['item_price'] = chipo['item_price'].apply(lambda x: float(x[1:]))

In [14]:
chipo['item_price'][0].dtype

dtype('float64')

In [15]:
print('Total revenue:', chipo['item_price'].sum(),'dollars')

Total revenue: 34500.16 dollars

In [16]:
print('Total number of orders:', chipo['order_id'].nunique())

Total number of orders: 1834

In [17]:
total_revenue = chipo['item_price'].sum()
total_orders = chipo['order_id'].nunique()
print('Average order value:', np.round(total_revenue / total_orders, 2))

Average order value: 18.81

In [18]:
print('Total unique items sold:', chipo['item_name'].nunique())

Total unique items sold: 50

# Exercise 2

In [19]:
print('Count of products that cost more than $10:', chipo[chipo['item_price'] > 10].shape[0])

Count of products that cost more than $10: 1130

# Exercise 3

In [20]:
users = pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user', sep='|')

In [21]:
users.head(10)

   user_id  age gender     occupation zip_code
0        1   24      M     technician    85711
1        2   53      F          other    94043
2        3   23      M         writer    32067
3        4   24      M     technician    43537
4        5   33      F          other    15213
5        6   42      M      executive    98101
6        7   57      M  administrator    91344
7        8   36      M  administrator    05201
8        9   29      M        student    01002
9       10   53      M         lawyer    90703

In [22]:
print(users.groupby('occupation')['age'].mean())

occupation
administrator    38.746835
artist           31.392857
doctor           43.571429
educator         42.010526
engineer         36.388060
entertainment    29.222222
executive        38.718750
healthcare       41.562500
homemaker        32.571429
lawyer           36.750000
librarian        40.000000
marketing        37.615385
none             26.555556
other            34.523810
programmer       33.121212
retired          63.071429
salesman         35.666667
scientist        35.548387
student          22.081633
technician       33.148148
writer           36.311111
Name: age, dtype: float64

In [23]:
# Exercise 4

In [24]:
data1 = {
    'Animal': ['Chimpanze', 'Beaver', 'Grand Beaver'],
    'Age': [23, 4, 15],
    'Random_word': ['Gudwin', 'Arch', 'Bold']
}
data2 = {
    'Animal': ['Собака', 'Кошка', 'Осел'],
    'Age': [1, 22, 1222],
    'Random_word': ['Sorcerer', 'Bow', 'Shwarma']
}

In [25]:
data1 = pd.DataFrame(data1)
data2 = pd.DataFrame(data2)

In [26]:
merged_data_row = pd.concat([data1, data2], ignore_index=True)

In [27]:
merged_data_col = pd.concat([data1, data2], axis=1)

In [28]:
merged_data_row

         Animal   Age Random_word
0     Chimpanze    23      Gudwin
1        Beaver     4        Arch
2  Grand Beaver    15        Bold
3        Собака     1    Sorcerer
4         Кошка    22         Bow
5          Осел  1222     Shwarma

In [29]:
merged_data_col

         Animal  Age Random_word  Animal   Age Random_word
0     Chimpanze   23      Gudwin  Собака     1    Sorcerer
1        Beaver    4        Arch   Кошка    22         Bow
2  Grand Beaver   15        Bold    Осел  1222     Shwarma

In [30]:
# Exercise 5

In [31]:
iris = pd.read_csv('https://archive.ics.uci.edu/ml/machine-learning-databases/iris/iris.data')

In [32]:
iris.head(5)

   5.1  3.5  1.4  0.2  Iris-setosa
0  4.9  3.0  1.4  0.2  Iris-setosa
1  4.7  3.2  1.3  0.2  Iris-setosa
2  4.6  3.1  1.5  0.2  Iris-setosa
3  5.0  3.6  1.4  0.2  Iris-setosa
4  5.4  3.9  1.7  0.4  Iris-setosa

In [33]:
iris.columns = ['sepal_length', 'sepal_width', 'petal_length', 'petal_width', 'species']

In [34]:
iris.head(0)

Empty DataFrame
Columns: [sepal_length, sepal_width, petal_length, petal_width, species]
Index: []

In [35]:
print(iris.isnull().sum())

sepal_length    0
sepal_width     0
petal_length    0
petal_width     0
species         0
dtype: int64

# Exercise 6: Creating Series And DataFrames (Pokemon)

In [36]:
pokemon_dict = {'evolution': ['Ivysaur', 'Charmeleon', 'Wartortle', 'Metapod'],
    'hp': [45, 39, 44, 45],
    'name': ['Bulbasaur', 'Charmander', 'Squirtle', 'Caterpie'],
    'pokedex': ['yes', 'no', 'yes', 'no'],
    'type': ['grass', 'fire', 'water', 'bug']}

In [37]:
pokemon = pd.DataFrame(pokemon_dict)

In [38]:
pokemon

    evolution  hp        name pokedex   type
0     Ivysaur  45   Bulbasaur     yes  grass
1  Charmeleon  39  Charmander      no   fire
2   Wartortle  44    Squirtle     yes  water
3     Metapod  45    Caterpie      no    bug

In [41]:
pokemon = pokemon[['name', 'type', 'hp', 'evolution', 'pokedex']]

In [42]:
pokemon

         name   type  hp   evolution pokedex
0   Bulbasaur  grass  45     Ivysaur     yes
1  Charmander   fire  39  Charmeleon      no
2    Squirtle  water  44   Wartortle     yes
3    Caterpie    bug  45     Metapod      no

# Exercise 7: Descriptive Statistics (Baby_names)

In [45]:
baby_names = pd.read_csv('https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv')

In [49]:
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

In [50]:
baby_names = baby_names.drop(columns=['Unnamed: 0', 'Id'])

In [51]:
baby_names.head(10)

       Name  Year Gender State  Count
0      Emma  2004      F    AK     62
1   Madison  2004      F    AK     48
2    Hannah  2004      F    AK     46
3     Grace  2004      F    AK     44
4     Emily  2004      F    AK     41
5   Abigail  2004      F    AK     37
6    Olivia  2004      F    AK     33
7  Isabella  2004      F    AK     30
8    Alyssa  2004      F    AK     29
9    Sophia  2004      F    AK     28

# Exercise 8: Handling Time Series Data (Investor_data)

In [64]:
investor_data = pd.read_csv('https://raw.githubusercontent.com/datasets/investor-flow-of-funds-us/master/data/weekly.csv')

In [65]:
frequency = investor_data.shape[0]

In [66]:
print(frequency)

44

In [67]:
investor_data.set_index('Date', inplace=True)

In [70]:
investor_data.head(3)

,Total Equity,Domestic Equity,World Equity,Hybrid,Total Bond,Taxable Bond,Municipal Bond,Total
Date,,,,,,,,
2012-12-05,-7426,-6060,-1367,-74,5317,4210,1107,-2183
2012-12-12,-8783,-7520,-1263,123,1818,1598,219,-6842
2012-12-19,-5496,-5470,-26,-73,103,3472,-3369,-5466